Repository: M1zz/ConversationPractice
Catalog: ConversationPractice/Localizable.xcstrings
Source language: en
Languages: es, id, ja, ko, zh_hans

source: Built-in Scenarios
es: Escenarios integrados
id: Skenario Bawaan
ja: 組み込みシナリオ
ko: 기본 시나리오
zh_hans: 内置场景

source: 🎉 Conversation Complete!
es: 🎉 ¡Conversación completada!
id: 🎉 Percakapan Selesai!
ja: 🎉 会話完了!
ko: 🎉 대화 완료!
zh_hans: 🎉 对话完成!

source: Delete
es: Eliminar
id: Hapus
ja: 削除
ko: 삭제
zh_hans: 删除

# display_mode_both
source: Both
es: Ambos
id: Keduanya
ja: 両方
ko: 모두
zh_hans: 两者

# display_mode_learning
source: Learning
es: Aprendizaje
id: Bahasa Belajar
ja: 学習言語
ko: 외국어
zh_hans: 学习语言

# display_mode_native
source: Native
es: Nativo
id: Bahasa Ibu
ja: 母国語
ko: 모국어
zh_hans: 母语

source: Done
es: Listo
id: Selesai
ja: 完了
ko: 완료
zh_hans: 完成

source: Free Conversation
es: Conversación libre
id: Percakapan Bebas
ja: フリートーク
ko: 자유 대화
zh_hans: 自由对话

# free_conversation_desc
source: Practice by chatting freely with AI
es: Practica conversando libremente con IA
id: Berlatih dengan berbicara bebas dengan AI
ja: AIと自由に会話して練習
ko: AI와 자유롭게 대화하며 연습
zh_hans: 与AI自由对话练习

source: Great job! ✓
es: ¡Bien hecho! ✓
id: Bagus sekali! ✓
ja: よくできました! ✓
ko: 잘했습니다! ✓
zh_hans: 做得好! ✓

source: Learning Language
es: Idioma de aprendizaje
id: Bahasa Belajar
ja: 学習言語
ko: 학습 언어
zh_hans: 学习语言

source: Me
es: Yo
id: Saya
ja: 私
ko: 나
zh_hans: 我

source: My Scenarios
es: Mis escenarios
id: Skenario Saya
ja: マイシナリオ
ko: 내 시나리오
zh_hans: 我的场景

source: Native Language
es: Idioma nativo
id: Bahasa Ibu
ja: 母国語
ko: 모국어
zh_hans: 母语

source: Partner
es: Compañero
id: Lawan bicara
ja: 相手
ko: 상대방
zh_hans: 对方

source: Practice
es: Práctica
id: Latihan
ja: 練習
ko: 연습
zh_hans: 练习

source: Practice Again
es: Practicar de nuevo
id: Latihan Lagi
ja: もう一度練習
ko: 다시 연습하기
zh_hans: 再练习一次

# practice_responding_subtitle
source: Practice responding to various answers in real situations
es: Practica respondiendo a varias respuestas en situaciones reales
id: Berlatih merespons berbagai jawaban dalam situasi nyata
ja: 実際の状況でさまざまな回答に対応する練習
ko: 실제 상황에서의 다양한 답변에 대응하는 연습
zh_hans: 练习在真实情况下应对各种回答

source: Pronunciation Practice
es: Práctica de pronunciación
id: Latihan Pengucapan
ja: 発音練習
ko: 발음 연습
zh_hans: 发音练习

# pronunciation_practice_desc
source: Practice accurate pronunciation
es: Practica la pronunciación correcta
id: Berlatih pengucapan yang akurat
ja: 正確な発音の練習
ko: 정확한 발음 연습
zh_hans: 练习准确发音

source: Reset Settings
es: Restablecer configuración
id: Reset Pengaturan
ja: 設定をリセット
ko: 설정 초기화
zh_hans: 重置设置

source: Say this phrase:
es: Di esta frase:
id: Ucapkan kalimat ini:
ja: このフレーズを言ってください:
ko: 이 문장을 말하세요:
zh_hans: 请说这句话:

source: Scenario Practice
es: Práctica de escenarios
id: Latihan Skenario
ja: シナリオ練習
ko: 시나리오 연습
zh_hans: 情景练习

# scenario_practice_desc
source: Practice conversations for real situations
es: Practica conversaciones para situaciones reales
id: Latihan percakapan untuk situasi nyata
ja: 実際の状況での会話練習
ko: 실제 상황별 대화 연습
zh_hans: 实际情景对话练习

# select_learning_language
source: Select Language to Learn
es: Selecciona idioma a aprender
id: Pilih Bahasa untuk Dipelajari
ja: 学習言語を選択
ko: 학습 언어 선택
zh_hans: 选择学习语言

# select_mode
source: Select Practice Mode
es: Selecciona modo de práctica
id: Pilih Mode Latihan
ja: 練習モードを選択
ko: 연습 모드 선택
zh_hans: 选择练习模式

# select_native_language
source: Select Your Language
es: Selecciona tu idioma
id: Pilih Bahasa Anda
ja: 母国語を選択
ko: 모국어 선택
zh_hans: 选择母语

source: Settings
es: Configuración
id: Pengaturan
ja: 設定
ko: 설정
zh_hans: 设置

source: Speaking...
es: Hablando...
id: Berbicara...
ja: 話しています...
ko: 말하고 있습니다...
zh_hans: 正在说话...

# start_conversation_guide
source: Press the microphone button to start conversation
es: Presiona el botón del micrófono para iniciar la conversación
id: Tekan tombol mikrofon untuk memulai percakapan
ja: マイクボタンを押して 会話を始めましょう
ko: 마이크 버튼을 눌러 대화를 시작하세요
zh_hans: 按下麦克风按钮 开始对话

source: Tap to speak
es: Toca para hablar
id: Ketuk untuk berbicara
ja: タップして話す
ko: 탭하여 말하기
zh_hans: 点击说话

source: Try again
es: Inténtalo de nuevo
id: Coba lagi
ja: もう一度試してください
ko: 다시 시도해보세요
zh_hans: 请再试一次

# what_is_native_language
source: What is your native language?
es: ¿Cuál es tu idioma nativo?
id: Apa bahasa ibu Anda?
ja: 母国語は何ですか？
ko: 모국어가 무엇인가요?
zh_hans: 您的母语是什么？

# what_language_to_learn
source: What language do you want to learn?
es: ¿Qué idioma quieres aprender?
id: Bahasa apa yang ingin Anda pelajari?
ja: 何語を学びたいですか？
ko: 어떤 언어를 배우고 싶으세요?
zh_hans: 您想学习什么语言？

# app_name
source: SpeakFlow
ja: スピークフロー
ko: 스픽플로우
